function birthChart() {
  var hour = document.getElementById("hour");
  var minute = document.getElementById("minute");
  var day = document.getElementById("day");
  var month = document.getElementById("month");
  let b = document.getElementById("duration");

  if (hour.value == "1" && b.value == "pm") {
    hour.value = "13";
  }
  else if (hour.value == "2" && b.value == "pm") {
    hour.value = "14";
  }
  else if (hour.value == "3" && b.value == "pm") {
    hour.value = "15";
  }
  else if (hour.value == "4" && b.value == "pm") {
    hour.value = "16";
  }
  else if (hour.value == "5" && b.value == "pm") {
    hour.value = "17";
  }
  else if (hour.value == "6" && b.value == "pm") {
    hour.value = "18";
  }
  else if (hour.value == "7" && b.value == "pm") {
    hour.value = "19";
  }
  else if (hour.value == "8" && b.value == "pm") {
    hour.value = "20";
  }
  else if (hour.value == "9" && b.value == "pm") {
    hour.value = "21";
  }
  else if (hour.value == "10" && b.value == "pm") {
    hour.value = "22";
  }
  else if (hour.value == "11" && b.value == "pm") {
    hour.value = "23";
  }
  if (hour.value == "01" && b.value == "pm") {
    hour.value = "13";
  }
  else if (hour.value == "02" && b.value == "pm") {
    hour.value = "14";
  }
  else if (hour.value == "03" && b.value == "pm") {
    hour.value = "15";
  }
  else if (hour.value == "04" && b.value == "pm") {
    hour.value = "16";
  }
  else if (hour.value == "05" && b.value == "pm") {
    hour.value = "17";
  }
  else if (hour.value == "06" && b.value == "pm") {
    hour.value = "18";
  }
  else if (hour.value == "07" && b.value == "pm") {
    hour.value = "19";
  }
  else if (hour.value == "08" && b.value == "pm") {
    hour.value = "20";
  }
  else if (hour.value == "09" && b.value == "pm") {
    hour.value = "21";
  }
  
  if (hour.value == "1" && b.value == "am") {
    hour.value = "01";
  }
  else if (hour.value == "2" && b.value == "am") {
    hour.value = "02";
  }
  else if (hour.value == "3" && b.value == "am") {
    hour.value = "03";
  }
  else if (hour.value == "4" && b.value == "am") {
    hour.value = "04";
  }
  else if (hour.value == "5" && b.value == "am") {
    hour.value = "05";
  }
  else if (hour.value == "6" && b.value == "am") {
    hour.value = "06";
  }
  else if (hour.value == "7" && b.value == "am") {
    hour.value = "07";
  }
  else if (hour.value == "8" && b.value == "am") {
    hour.value = "08";
  }
  else if (hour.value == "9" && b.value == "am") {
    hour.value = "09";
  }
  
  if (minute.value == "1") {
    minute.value = "01";
  }
  else if (minute.value == "2") {
    minute.value = "02";
  }
  else if (minute.value == "3") {
    minute.value = "03";
  }
  else if (minute.value == "4") {
    minute.value = "04";
  }
  else if (minute.value == "5") {
    minute.value = "05";
  }
  else if (minute.value == "6") {
    minute.value = "06";
  }
  else if (minute.value == "7") {
    minute.value = "07";
  }
  else if (minute.value == "8") {
    minute.value = "08";
  }
  else if (minute.value == "9") {
    minute.value = "09";
  }
  if (day.value == "1") {
    day.value = "01";
  }
  else if (minute.value == "2") {
    day.value = "02";
  }
  else if (day.value == "3") {
    day.value = "03";
  }
  else if (day.value == "4") {
    day.value = "04";
  }
  else if (day.value == "5") {
    day.value = "05";
  }
  else if (day.value == "6") {
    day.value = "06";
  }
  else if (day.value == "7") {
    day.value = "07";
  }
  else if (day.value == "8") {
    day.value = "08";
  }
  else if (day.value == "9") {
    day.value = "09";
  }

  if (month.value == "1") {
    month.value = "01";
  }
  else if (month.value == "2") {
    month.value = "02";
  }
  else if (month.value == "3") {
    month.value = "03";
  }
  else if (month.value == "4") {
    month.value = "04";
  }
  else if (month.value == "5") {
    month.value = "05";
  }
  else if (month.value == "6") {
    month.value = "06";
  }
  else if (month.value == "7") {
    month.value = "07";
  }
  else if (month.value == "8") {
    month.value = "08";
  }
  else if (month.value == "9") {
    month.value = "09";
  }


  var name = document.getElementById("name").value;
  var district = document.getElementById("district").value;
  var state = document.getElementById("state").value;
  var hour = document.getElementById("hour").value;
  var minute = document.getElementById("minute").value;
  var day = document.getElementById("day").value;
  var month = document.getElementById("month").value;
  var year = document.getElementById("year").value;



  if (name == "") {
    alert("Name is missing")
  }
  else if (district == "") {
    alert("District is missing")
  }
  else if (state == "") {
    alert("State is missing")
  }
  else if (hour == "") {
    alert("Hour is missing")
  }
  else if (minute == "") {
    alert("Minute is missing")
  }
  else if (day == "") {
    alert("day is missing")
  }
  else if (month == "") {
    alert("Month is missing")
  }
  else if (year == "") {
    alert("Year is missing")
  }
  else {
    document.getElementById("image").src = "https://vedastroapi.azurewebsites.net/api/Calculate/SouthIndianChart/Location/" + district + "," + state + ",India/Time/" + hour + ":" + minute + "/" + day + "/" + month + "/" + year + "/+05:30";

    const scriptURL = 'https://script.google.com/macros/s/AKfycbzModBriWWloNgLE_fon87jAvfqBfjZfFcPqOpoP7PLEIR-r_17Wn3AHdipw0Jtd7FE-Q/exec'


    const form = document.forms['contact-form']

    form.addEventListener('submit', e => {
      e.preventDefault()
      fetch(scriptURL, { method: 'POST', body: new FormData(form) })
    })
  }
}

function touchmenow() {
  let data = {
    "sun1": "तो, हम देखते हैं कि पहले घर में सूर्य ऊर्जा, महत्वाकांक्षा, सफलता, उपलब्धि और उपलब्धि के बारे में है। लेकिन फिर जातक को कड़ी मेहनत करनी होगी और इन क्षमताओं का अपने लाभ के लिए उपयोग करना होगा। प्रथम भाव में सूर्य की स्थिति वाले जातक जीवन में बहुत कुछ हासिल कर सकते हैं। लेकिन वे अपने गुस्से और अहंकार से परेशान हो सकते हैं। सूर्य ग्रह की तरह ही आपको प्रथम भाव में अन्य ग्रहों के परिणामों का विश्लेषण करने का प्रयास करना चाहिए। कुंडली में सूर्य ग्रह पर अन्य ग्रहों के गोचर का भी हमेशा विचार करें क्योंकि अन्य ग्रह गोचर भी आपके जीवन पर बहुत प्रभाव डालते हैं।",
    "sun2": "दूसरे भाव में सूर्य की स्थिति वाले जातक प्रचुर धन-संपदा और अपेक्षाकृत मधुर संबंधों से संपन्न होते हैं। हालाँकि, आपको अत्यधिक खर्च और किसी भी काम को करने के सही तरीके के जुनून से सावधान रहने की जरूरत ह",
    "sun3": "तीसरा भाव संचार के बारे में है। इसलिए, जब सूर्य इस घर में रहता है, तो व्यक्ति काफी बातूनी और अभिव्यंजक हो सकता है। कभी-कभी व्यक्ति कुछ ऐसा कह सकता है जो लोगों को अच्छा नहीं लगेगा। इससे उन्हें परेशानी भी हो सकती है। ऐसे में उन्हें इस मोर्चे पर सावधान रहने की जरूरत है।",
    "sun4": "वे अपने परिवार के सदस्यों और घरेलू खुशियों से गहराई से जुड़े होते हैं। वे अपने प्रियजनों का अच्छे से ख्याल रखते हैं। लेकिन उन्हें यह सुनिश्चित करना चाहिए कि वे उन्हें अनावश्यक लाड़-प्यार न दें। बस वहां मौजूद रहना और जरूरत पड़ने पर उनकी मदद करना ही काफी है। इसके अलावा, घर के बाहर की चीजों को नजरअंदाज करना जीवन जीने का अच्छा तरीका नहीं हो सकता है, इसमें संतुलन होना चाहिए",
    "sun5": "यदि सूर्य आपके पंचम भाव में स्थित है तो यह आपको रचनात्मक और अभिव्यंजक बना देगा। आपको दिलचस्प खेल गतिविधियों, रोमांस, नाटक आदि में भी बहुत आनंद मिल सकता है। साथ ही संतान को लेकर भी कुछ न कुछ परेशानियां बनी रहेंगी। या तो आपको उन्हें जन्म देने में समस्या होगी या उनके स्वास्थ्य और खुशहाली पर असर पड़ सकता है।",
    "sun6": "छठे भाव में सूर्य वाले जातक हमेशा भयपूर्ण और असुविधाजनक परिस्थितियों से लड़ते रहते हैं और अपने जीवन में सुरक्षा स्थापित करने का प्रयास करते रहते हैं। वे अपने स्वास्थ्य और कल्याण को बहुत महत्व देते हैं। वे बहादुर सेनानी और गतिशील नायक हो सकते हैं जो अपने जीवन और अपने प्रियजनों के जीवन को बेहतर बनाने के लिए सब कुछ कर सकते हैं।",
    "sun7": "वैसे, सातवें भाव में सूर्य वाले जातक अपने साझेदारों पर अत्यधिक निर्भर होते हैं। वे अपनी ताकत और शक्ति उस बंधन से प्राप्त करते हैं जिसे वे दूसरों के साथ साझा करते हैं। साथ ही आपको यह भी सुनिश्चित करना चाहिए कि आप अपने पार्टनर से बहुत ज्यादा उम्मीदें न रखें। इससे दूसरों के साथ आपके रिश्ते बेहतर होंगे। और तब तुम्हें लाभ होना निश्चित है।",
    "sun8": "आठवें भाव में सूर्य वाले जातक परिस्थितियों से निपटने में काफी कुशल होते हैं। हालाँकि, उन्हें कम संवेदनशील और अधिक मिलनसार होना चाहिए। अन्यथा वे कुछ अच्छे दोस्त पाने से चूक सकते हैं और वे अधिक संपूर्ण जीवन जीने में असफल हो सकते ",
    "sun9": "आप धर्मात्मा, धर्मात्मा एवं धर्मात्मा हैं। आप बहुत सकारात्मक और जिज्ञासु हैं. साथ ही, आप भाग्यशाली भी रहेंगे क्योंकि कई मौकों पर भाग्य आपका साथ देगा। आप कोई विदेशी भाषा और संस्कृति सीखना चाह सकते हैं। हालाँकि, यह बेहतर होगा यदि आपकी नई भाषा (या संस्कृति) सीखने से आपको किसी ऐसी चीज़ में मदद मिलती है जो आपके करियर की संभावनाओं को प्रभावित करती है। इसके अलावा, किसी भी प्रकार के अहंकार से सावधान रहें क्योंकि यह आपके जीवन पर बोझ डाल सकता है।",
    "sun10": "आप करियर-उन्मुख रहेंगे। आपके अपने पेशे में अच्छा प्रदर्शन करने की संभावना है। साथ ही आप अपने परिवार के सदस्यों पर भी पर्याप्त ध्यान देंगे। दरअसल, आप अपनी सफलता और अनुभव अपने परिवार, खासकर अपने जीवनसाथी के साथ साझा करेंगे। आपके अपने बच्चों के साथ अच्छे संबंध रहने की संभावना है। लेकिन आपको कार्यस्थल पर दूसरों के विचारों और राय के प्रति अधिक उदार होना चाहिए।",
    "sun11": "यह बहुत अच्छी बात है कि आप अच्छाई और ख़ुशी में विश्वास करते हैं। हालाँकि, आपको व्यावहारिक वास्तविकता को भी ध्यान में रखना चाहिए। यह आपको अच्छाई से रोकने के लिए नहीं है, बल्कि यह सुनिश्चित करने के लिए है कि आप अपने मूल्यों और नैतिकता का पालन करते हुए वास्तविकता पर अधिक आधारित हों। आदर्श तभी वास्तविकता में बदलेंगे जब आप उन्हें व्यावहारिक जीवन से जोड़ेंगे।",
    "sun12": "12वें घर में सूर्य के जातकों के लिए ज्योतिषीय परिदृश्य अधिकांश अन्य घरों में ( सूर्य की उपस्थिति के) दृश्य के विपरीत सरल नहीं है। चूंकि वे मन और चेतना के अधिक गहरे स्तरों में हैं, इसलिए वे अस्तित्व की सबसे जटिल वास्तविकता से निपट रहे हैं। हालाँकि, यह उन्हें अपने आध्यात्मिक स्तर को ऊपर उठाने और अपने और समाज के लिए चमत्कार करने का सुनहरा अवसर भी प्रदान कर सकता है।",

    "moon1": "हर समय अपने तरीके निर्धारित करना संभव नहीं है, भले ही वे सही तरीके हों। आपको जहां भी और जब भी आवश्यकता हो, अन्य लोगों की इच्छाओं और आवश्यकताओं के साथ तालमेल बिठाना चाहिए",
    "moon2": "अंततः यहां हम कह सकते हैं कि, कुंडली के द्वितीय भाव में चंद्र के होने से जातक व्यक्ति के आर्थिक रूप से मजबूत होने की अधिक संभावनाएं होती हैं। और साथ ही ऐसे जातक समझदार और जिम्मेदार भी होते हैं। लेकिन किसी वस्तु या व्यक्ति विशेष से आपका अधिक लगाव, आपको भावनात्मक रूप से परेशान कर सकता है। ज्योतिष शास्त्र में चंद्र ग्रह को महत्व दिया जाता है। हालांकि खगोलीय दृष्टि में चंद्रमा को पृथ्वी ग्रह का एक प्राकृतिक उपग्रह माना जाता है। ज्योतिष के अनुसार, इसके द्वारा व्यक्ति की चंद्र राशि ज्ञात की जाती है। हमारी जन्म कुंडली में स्थित 12 भावों में चंद्र ग्रह, अलग-अलग रूप से प्रभाव डालते  है। उन प्रभावों को के बारे में आप इस लेख में विस्तृत रूप से जान सकते हैं।",
    "moon3": "कुल मिलाकर कहा जा सकता है कि कुंडली के तीसरे भाव में चंद्र ग्रह के विराजमान होने से, जातक संवाद कौशल में निपूर्ण और अन्य लोगों की भावनाओं व इच्छाओं को आसानी से समझने वाले हो सकते हैं। हालांकि ज्योतिष की सलाह में इन जातकों को कई बार अपने गुणों का उपयोग सही दिशा में करने के लिए प्रेरित होने की सलाह दी जाती है। परन्तु ये जातक, फिर भी वे मिलनसार और तीव्र बुद्धि के धनी होते हैं, और दूसरे लोगों और उनकी परिस्थितियों को आसानी से समझ कर, उनका सामना करने के साथ-साथ उनसे कुछ नया और बेहतर सीखने की दिशा में अग्रसर भी होते हैं",
    "moon4": "जिन जातकों के चतुर्थ भाव में चंद्रमा होता है वे भावुक और पारिवारिक होते हैं। हालाँकि, वे जीवन में अधिक प्रभावी होंगे यदि वे अपनी भावनात्मक निर्भरता को कम कर सकें और व्यावहारिकता के कुछ तत्वों को अपना सकें।",
    "moon5": "खैर, वे रिश्तों और प्रेम जीवन में अच्छे रहेंगे।  हालाँकि, उन्हें अपने स्वभाव पर नियंत्रण रखने में सावधानी बरतनी चाहिए।  वे पेशे में अच्छा प्रदर्शन करेंगे, खासकर यदि वे रचनात्मक क्षेत्रों में अपना करियर बनाते हैं, और साथ ही, यह अच्छा है कि वे संवेदनशील हैं।  हालाँकि, उन्हें अन्य लोगों की जरूरतों और चाहतों को भी समझने की जरूरत है।  साथ ही वाहन चलाते समय भी इन्हें सावधानी बरतने की जरूरत ह",
    "moon6": "बुध  अभिव्यक्ति और बुद्धि का कारक है। 5वां घर रोमांटिक रिश्तों, सुखद भावनाओं, संतानों से संबंधित है और इसलिए उनका संयोजन बहुत जानकार व्यक्ति बना सकता है, जो बहुत अच्छे शिक्षक हो सकते हैं। हालाँकि जातकों को बातों को बहुत आगे तक ले जाने से बचना चाहिए। उन्हें कुछ चीज़ों से अनावश्यक रूप से जुड़ने से बचना चाहिए, जो उनके अहंकार को बढ़ा सकती हैं और उनके जीवन में कष्ट ला सकती हैं।",
    "moon7": "इस प्रकार, हम देखते हैं कि सातवें घर में चंद्रमा जातकों के जीवन में भारी विकास ला सकता है। यदि वे अपना जीवन ठीक से और प्रभावी ढंग से चला सकते हैं, तो वे पेशेवर और व्यक्तिगत जीवन में ऊंचा उठ सकते हैं। हालाँकि, यदि वे अपने दिमाग को अपनी बात कहने की अनुमति देते हैं, तो इससे एक कठिन स्थिति पैदा हो सकती है।",
    "moon8": "संक्षेप में, यह देखा गया है कि जिन जातकों के  आठवें घर में चंद्रमा है  , वे जीवन के उतार-चढ़ाव से काफी परेशान हो सकते हैं। सबसे महत्वपूर्ण बात यह है कि वे इन परिस्थितियों का सामना कैसे करते हैं और जीवन की जटिलताओं को कैसे संबोधित करते हैं। जातकों को सलाह दी जाती है कि वे शांत रहें और अपने अतीत के बारे में सोचने में प्रयास बर्बाद न करें। जो बीत गया सो बीत गया, और आप सकारात्मक रहकर और अतीत से सबक सीखकर और गलतियों को न दोहराकर अपने कल को उज्जवल और चमकदार बना सकते ह",
    "moon9": "जब चंद्रमा नौवें भाव में हो तो जातक कई देशों की यात्रा करना पसंद करेंगे। नवम भाव में चंद्रमा की विवाह कुंडली के अनुसार विदेशी संबंध बनाने की संभावना बहुत अधिक है, चाहे वह पत्नी हो, मित्र हो, या व्यवसाय हो। शिक्षा भी उनके जीवन में एक आवश्यक भूमिका निभाती है क्योंकि वे दूसरों की तुलना में अधिक बुद्धिमान और रचनात्मक होते हैं। हालाँकि, उन्हें यह सुनिश्चित करना चाहिए कि उनकी सकारात्मकता मन की नकारात्मक स्थिति में परिवर्तित न हो जाए अन्यथा वे अपनी अधिकांश ताकत खो देंगे।",
    "moon10": "दशम भाव में मंगल की स्थिति वाले जातकों में मंगल की अग्नि होगी। इसका उपयोग पेशे में उचित रूप से किया जा सकता है और परिणामस्वरूप जातक बहुत ऊंचे स्थान पर पहुंच सकते हैं। हालाँकि, इन जातकों को लोगों के साथ व्यवहार करते समय बहुत सावधान रहना होगा अन्यथा इनकी उतनी उन्नति नहीं हो पाएगी।",
    "moon11": "दूसरे भाव में मंगल की स्थिति वाले जातक शेयर बाजार, ट्रेडिंग जैसे सट्टा क्षेत्रों में अच्छा प्रदर्शन कर सकते हैं। वे एक अच्छे इंसान भी हो सकते हैं और अपने रिश्तों के साथ पूरा न्याय कर सकते हैं। हालाँकि, एक कारक जो उन्हें निराश करता है वह है उनका बुरा स्वभाव। वे अपने व्यवहार में अधिक संयमित रहकर और पैसे के प्रति कम लगाव रखकर अपनी सफलता को अधिकतम कर सकते हैं।",
    "moon12": "अंत में यदि कुंडली के बारहवें भाव में चंद्र ग्रह के प्रभावों की गणना की जाए तो , इस निष्कर्ष पर पहुंचा जा सकता है, कि ऐसे जातक विचारशील और भावनाओं में विलीन होते हैं। कई बार इन जातकों को अंतर्मुखी व्यक्तित्व का भी समझा जाता है, लेकिन वास्तव में ऐसा होता नहीं है। साथ ही ये जातक किसी परिवेश या वातावरण में ढलने के लिए अधिक समय बिताने की जरूरत को महसूस करते है। ऐसे जातकों को लोगों की खुद के लिए सोच बदलने हेतु स्वयं को अधिक काबिल पेश करने का प्रयास करना होगा। जिससे कि लोगों की इनके प्रति धारणा को परिवर्तित कर सकें। इसके अलावा, ऐसे जातकों को अपनी भावनाओं पर भी नियंत्रण रखने की सलाह दी जाती है। अन्यथा उन्हें चंद्र ग्रह के प्रतिकूल और नकारात्मक प्रभावों का सामना भी करना पड़ सकता है। हालांकि वैदिक ज्योतिष की गणना में, चंद्रमा से संबंधित सभी प्रतिकूल परिस्थितियों से मुक्ति हेतु उपायों का उल्लेख किया गया है। जिससे चंद्र ग्रह के नकारात्मक प्रभावों को दूर किया जा सकता ह",

    "mercury1": "आप बुद्धिमान और दिलचस्प हैं. आप हमेशा नई बातों और विचारों से भरे रहते हैं। लेकिन फिर आपका लचीला होना और हर समय नई चीजें तलाशने का गुण आपकी कमजोरी भी बन सकता है। आप चीजों को पकड़कर रखने में सक्षम नहीं हो सकते हैं, जिसकी कीमत आपको जीवन भर चुकानी पड़ सकती है। धैर्य सफलता की मूलभूत आवश्यकताओं में से एक है, इसे विकसित करना होगा भले ही यह स्वाभाविक रूप से न हो।",
    "mercury2": "दूसरे भाव में बुध वाले जातक तर्क-वितर्क और धन प्रबंधन में अच्छे होते हैं। हालाँकि, हो सकता है कि उन्हें काम करने के लिए दबाव डाला जाना पसंद न हो। इसके अलावा, वे अपनी बुद्धि और प्रबंधन कौशल के कारण अहंकारी हो सकते हैं, इसलिए उन्हें इस संबंध में बहुत सावधान रहने की जरूरत है",
    "mercury3": "बुध ग्रह बुद्धि और संचार का कारक है। और जब यह तीसरे भाव में रहता है तो जातक बहुत कुछ जानना और सीखना चाहते हैं। लेकिन जब मात्रा बढ़ती है, तो गुणवत्ता पीछे रह जाती है। या जब पार्श्विक वृद्धि (फैलाव) बहुत अधिक हो जाए तो ऊर्ध्वाधर वृद्धि (गहराई या ऊंचाई) को नुकसान उठाना पड़ेगा। इस प्रकार, अधिक से अधिक खोज करने की इच्छा में, तीसरे घर में बुध के जातक कुछ महत्वपूर्ण चीजों के विवरण से चूक सकते हैं।",
    "mercury4": "चौथे घर में स्थित बुध  यह दर्शाता है कि यदि जातक लोगों के प्रति ईमानदार और स्पष्टवादी है, तो उसे इसके बेहतर परिणाम मिलेंगे। चौथे घर में मौजूद राशि और इसके साथ ग्रहों के संयोजन जैसी कई चीजें हैं, इसके वास्तविक प्रभाव को जानने के लिए इसे ध्यान में रखा जाना चाहिए। ",
    "mercury5": "बुध अभिव्यक्ति और बुद्धि का कारक है। 5 वां घर  रोमांटिक रिश्तों, सुखद भावनाओं, संतानों से संबंधित है और इसलिए उनका संयोजन बहुत जानकार व्यक्ति बना सकता है, जो बहुत अच्छे शिक्षक हो सकते हैं। हालाँकि जातकों को बातों को बहुत आगे तक ले जाने से बचना चाहिए। उन्हें कुछ चीज़ों से अनावश्यक रूप से जुड़ने से बचना चाहिए, जो उनके अहंकार को बढ़ा सकती हैं और उनके जीवन में कष्ट ला सकती हैं।",
    "mercury6": "बुध  अभिव्यक्ति और बुद्धि का कारक है। 5वां घर रोमांटिक रिश्तों, सुखद भावनाओं, संतानों से संबंधित है और इसलिए उनका संयोजन बहुत जानकार व्यक्ति बना सकता है, जो बहुत अच्छे शिक्षक हो सकते हैं। हालाँकि जातकों को बातों को बहुत आगे तक ले जाने से बचना चाहिए। उन्हें कुछ चीज़ों से अनावश्यक रूप से जुड़ने से बचना चाहिए, जो उनके अहंकार को बढ़ा सकती हैं और उनके जीवन में कष्ट ला सकती हैं।",
    "mercury7": "सातवें घर में बुध की उपस्थिति जातकों के लिए दोनों रास्ते काटती है। यह उनके रिश्तों को दयालुता, ईमानदारी और सच्चाई के साथ पोषित और बढ़ावा देता है। वे एकजुटता को महत्व देते हैं। वे क्षण, भावनाएँ और खुशियाँ साझा करते हैं। दोनों के रिश्ते की डोर कई सालों बाद भी तरोताजा बनी हुई है। वे अब भी अपने पार्टनर से ऐसे प्यार करते हैं जैसे यह उनकी पहली डेट हो।",
    "mercury8": "आठवें भाव में बुध के जातक अपने दृष्टिकोण और दृष्टिकोण में विश्लेषणात्मक और खोजी होते हैं। हालाँकि, उन्हें उन लोगों के प्रति अधिक खुला होना चाहिए जो उनके करीब हैं, तभी वे दूसरों के साथ एकीकृत होंगे और एक पूर्ण और संतुष्टिपूर्ण जीवन जी सकेंगे।",
    "mercury9": "नौवें घर में बुध के जातक बहुत ऊंचे स्थान पर जा सकते हैं क्योंकि वे बहुत बुद्धिमान और बुद्धिमान होते हैं। हालाँकि, उन्हें अहंकार और अतिरंजित आत्म-महत्व की भावनाओं से सावधान रहना चाहिए।",
    "mercury10": "दशम भाव में स्थित बुध जातक बहुत बुद्धिमान और समझदार हो सकता है। वे बहुत अच्छे लेखक भी बन सकते हैं। हालाँकि, उन्हें इस बात से सावधान रहना होगा कि वे क्या खरीदते हैं। उन्हें दूसरों को यह समझाने की कोशिश करनी चाहिए कि यह कोई स्टेटस सिंबल नहीं बल्कि एक जरूरत है।",
    "mercury11": "ग्यारहवें भाव में बुध के प्रभाव से जातक कला में रुचि रखने वाला, ज्योतिष एवं मस्तिष्क विज्ञान में रुचि रखने वाला होता है। इसके साथ ही इन्हें कुशल लेखक और शासन-प्रशासन से लाभ मिलेगा। ऐसे जातकों की गुप्त विद्याओं में रुचि गहरी होती है और वे संगीत कला का भी अच्छा ज्ञान प्राप्त कर लेते हैं।ज्योतिष शास्त्र के अनुसार बुध ग्रह हमारी कुंडली में स्थित सभी 12 भावों पर अलग-अलग प्रभाव डालते हैं। ये प्रभाव हमारे जीवन को प्रत्यक्ष एवं अप्रत्यक्ष रूप से प्रभावित करते हैं।",
    "mercury12": "",

    "venus1": "पहले घर में शुक्र आपको बहुत आकर्षक बनाता है, आपको उच्च यौन आग्रह देता है, आपको कामुकता और चुंबकत्व का आशीर्वाद देता है।  विपरीत लिंग आपको पसंद करता है।  शुक्र अपनी ही राशि, यानी वृषभ और तुला में, आपको जानवरों, विशेषकर कुत्तों के प्रति एक भावुक प्रेम देगा।  पहले घर में शुक्र कोटिपति योग भी बना सकता है जो आपको करोड़पति (10 करोड़ की संपत्ति का मालिक) बना सकता है।",
    "venus2": "वैदिक ज्योतिष में जब शुक्र की सौम्यता दूसरे घर से मिलती है, तो इसका परिणाम एक भोग-प्रेमी व्यक्ति होता है जो सभी विलासिता और धन से प्यार करता है। इनके पास पैसा होगा, इसे खुले हाथ से खर्च करेंगे। लेकिन उन्हें यहां सावधानी बरतने की जरूरत होगी. यदि वे अनावश्यक चीज़ों पर बहुत सारा पैसा खो देते हैं, तो उन्हें नकदी संकट का सामना करना पड़ सकता है। साथ ही उन्हें अपने आस-पास के लोगों से अनावश्यक उम्मीदें नहीं रखनी चाहिए।",
    "venus3": "शुक्र ग्रह जीवन की खुशियों और आनंद के बारे में है। और तीसरा घर भाई-बहनों, मन की स्थितियों, पढ़ने, लिखने आदि को पूरा करता है। इसलिए ये जातक लिखित और मौखिक दोनों रूपों में बहुत अभिव्यंजक और संचारी होते हैं। इन जातकों के लिए रिश्ते बहुत महत्वपूर्ण होते हैं। हालाँकि, उन्हें रिश्तों को बहुत गंभीरता से नहीं लेना चाहिए और चिंताओं और परेशानियों से दूर रहने की कोशिश करनी चाहिए",
    "venus4": "संक्षेप में, चतुर्थ भाव में शुक्र की स्थिति  जातक के जीवन पर प्रतिकूल और सकारात्मक दोनों प्रभाव डालती है। यह जातक के कार्यों और परिस्थितियों के प्रति दृष्टिकोण के अनुसार बदलता रहता है। लेकिन सबसे महत्वपूर्ण बात यह है कि जातक अपने जीवन के हर पहलू में एक आनंदमय जीवन का अनुभव करते हैं, चाहे वह विपरीत लिंग के साथ संबंध हो, शारीरिक सुख, करिश्मा हो और वाहनों, घर और असाधारण जीवनशैली आदि सहित विलासितापूर्ण सुख-सुविधाओं का तो जिक्र ही न करें।",
    "venus5": "वे जीवन के कुछ प्रमुख क्षेत्रों में प्रेम और शांति का प्रतीक हैं। वे चंचल और मौज-मस्ती करने वाले भी होते हैं और जहां भी जाते हैं उत्साह और खुशी का संचार करते हैं। हालाँकि, कुछ मामलों में, वे बहुत अधिक आत्म-मुग्ध हो सकते हैं और विशेष रूप से अपने जीवन साथी के साथ बहुत अधिक मांग करने वाले हो सकते हैं। इसके अलावा, उनकी रोमांटिक खोज उन्हें कम उम्र में मौज-मस्ती और आनंद दे सकती है, लेकिन जैसे-जैसे वे बड़े होंगे, उन्हें भौतिक सुखों की निरर्थकता का एहसास होगा।",
    "venus6": "छठे भाव में शुक्र के जातकों को उनके देखभाल और साझा करने के रवैये के कारण पसंद किया जाता है। हालाँकि, उन्हें काम और पेशे के मामले में पूर्णतावादी और निर्दयी होने से बचना होगा। हर समय दूसरों से बहुत ऊंचे मानकों की अपेक्षा करना आदर्श नहीं हो सकता है।",
    "venus7": "सातवें घर में शुक्र जातकों के जीवन में अनुभव होने वाले सबसे भाग्यशाली संयोजनों में से एक है। यह व्यक्ति के रिश्ते को सभी खुशियों और आनंद से भर देता है। लंबे समय तक चलने वाले रिश्तों के लिए शुक्र एक अच्छा संकेत है। लेकिन यदि सातवें घर में शुक्र का परिणाम खराब हो तो यह जातकों के बीच संबंधों को कमजोर करता है और उनके जीवन में संघर्ष बढ़ाता है। यह स्थिति दो पहलू वाले सिक्के की तरह है, जिसके व्यक्ति पर अनुकूल और प्रतिकूल दोनों तरह के परिणाम होते हैं।",
    "venus8": "आठवें भाव में शुक्र की स्थिति वाले जातकों का जीवन सभी सुख-सुविधाओं और विलासिता से भरपूर हो सकता है। वे रिश्तों में भी प्रगाढ़ हो सकते हैं और संबंधों और संबंधों में गहराई तलाश सकते हैं। हालाँकि, उन्हें दूसरों से अधिक अपेक्षा नहीं करनी चाहिए और अपनी इच्छाओं से अति उत्तेजित नहीं होना चाहिए",
    "venus9": "नवम भाव में शुक्र के प्रभाव के अनुसार जातक रिश्तों को निभाने और उन्हें संवारने में अच्छे होते हैं। वे साहसी और खोजी भी होते हैं। हालाँकि, उन्हें अपने दुस्साहस को बहुत आगे तक नहीं ले जाना चाहिए। नई चीजों में शामिल होना अच्छा है. लेकिन इसके लिए यह भी आवश्यक है कि कुछ चीजों को उनकी प्राचीन शुद्धता में बनाए रखा जाए।",
    "venus10": "दशम भाव में शुक्र की स्थिति वाले जातक पेशे में ऊंचे स्थान पर पहुंच सकते हैं। वे काफी लोकप्रिय भी हो सकते हैं. हालाँकि, उन्हें इस बारे में अत्यधिक चिंतित नहीं होना चाहिए कि दूसरे उनके बारे में क्या सोचते हैं और क्या बात करते हैं।",
    "venus11": "कुल मिलाकर हम कह सकते हैं कि, एक संपन्न और सुखद सामाजिक जीवन की सुविधा में कुंडली के ग्यारहवें भाव में को शुक्र ग्रह, आकर्षण और अनुग्रह द्वारा समर्थित किया गया है। इसके अलावा, जो भी राशि इस भाव में होगी, शुक्र ग्रह उस स्वभाव व वैयक्तिक आकर्षण को बढ़ावा देगा",
    "venus12": "कुल मिलाकर कहा जा सकता है कि, बारहवें भाव में शुक्र से प्रभावित जातक, अपने धन को शुभ कार्यों में खर्च करके आनंद का अनुभव करते हैं। इस भाव का शुक्र ग्रह जातक को, काम क्रीड़ा में निपुणता प्रदान करता है। साथ ही ऐसे जातक विपरीत लिंगियों के आकर्षण का केंद्र होते हैं। वें जातक अपने आचरण से सबको प्रसन्न रखने का प्रयास करते हैं और कामयाब भी होते हैं",

    "mars1": "आप उग्र और आक्रामक हैं. साथ ही आप सक्रिय और गतिशील रहते हैं। मूल बात यह है कि, आपको अपनी ऊर्जा पर नियंत्रण रखना होगा और इसका सकारात्मक, रचनात्मक और उत्पादक ढंग से उपयोग करना होगा। इसके अलावा, आपको अपनी गतिविधियों के लिए अधिक संगठित और योजनाबद्ध होने की आवश्यकता है। यदि आप असंगठित तरीके से काम करते हैं, तो आपको वांछित सफलता मिलने की संभावना नहीं है। लेकिन अगर आप सही प्लानिंग के साथ काम करेंगे तो आप कहीं भी जा सकते हैं।",
    "mars2": "दूसरे भाव में मंगल की स्थिति वाले जातक शेयर बाजार, ट्रेडिंग जैसे सट्टा क्षेत्रों में अच्छा प्रदर्शन कर सकते हैं। वे एक अच्छे इंसान भी हो सकते हैं और अपने रिश्तों के साथ पूरा न्याय कर सकते हैं। हालाँकि, एक कारक जो उन्हें निराश करता है वह है उनका बुरा स्वभाव। वे अपने व्यवहार में अधिक संयमित रहकर और पैसे के प्रति कम लगाव रखकर अपनी सफलता को अधिकतम कर सकते हैं।",
    "mars3": "तीसरे भाव में मंगल ग्रह के जातक विचार, ऊर्जा और जानकारी से भरपूर होते हैं। हालाँकि, उन्हें इसका उपयोग अच्छे कारणों से करना चाहिए। उन्हें अपने गुस्से पर नियंत्रण रखना चाहिए और किसी भी बात को लेकर उग्र नहीं होना चाहिए।",
    "mars4": "जिन जातकों के चतुर्थ भाव में चंद्रमा होता है वे भावुक और पारिवारिक होते हैं। हालाँकि, वे जीवन में अधिक प्रभावी होंगे यदि वे अपनी भावनात्मक निर्भरता को कम कर सकें और व्यावहारिकता के कुछ तत्वों को अपना सकें।",
    "mars5": "वैदिक ज्योतिष के अनुसार , जन्म कुंडली में मंगल ग्रह व्यक्ति के जीवन में एक प्रमुख भूमिका निभाता है। अशुभ ग्रह होने के कारण यह व्यक्ति पर नकारात्मक और सकारात्मक दोनों तरह से प्रभाव डालता है। पंचम भाव में स्थित मंगल जातक को रचनात्मक, बुद्धिमान, प्यारा और रोमांटिक बनाता है लेकिन जातक को आत्मकेंद्रित, अपमानजनक और आक्रामक बनाने के लिए भी जिम्मेदार होता है। समीकरण को संतुलित करने के लिए अपने कार्यों पर नियंत्रण रखना चाहिए और प्रेम संबंधों को लेकर सतर्क रहने की सलाह दी जाती है। इसके अलावा मंगल आपको ज्ञान और आर्थिक भाग्य भी प्रदान करता है।",
    "mars6": "पेशेवर होना अच्छा है. लेकिन फिर यह बुनियादी मानवता की कीमत पर नहीं आना चाहिए। नियोक्ता या बॉस के लिए अपने कर्मचारियों से काम करवाना आवश्यक है। लेकिन दूसरों के स्वाभिमान को पूरी तरह से नजरअंदाज करना खतरनाक हो सकता है और जातकों को अलोकप्रिय बना सकता है। इसलिए, प्रगति और मानवता तथा कार्य और जीवन में उचित संतुलन होना चाहिए।",
    "mars7": "जिन व्यक्तियों के सातवें घर में मंगल होता है, वे अपने जीवन में उतार-चढ़ाव दोनों का अनुभव करते हैं। यह व्यक्ति को अपने जीवन की बाधाओं को दूर करने के लिए शारीरिक और मानसिक दोनों शक्ति प्रदान करता है। सातवें घर में मंगल की उपस्थिति जातकों को ढेर सारी खुशियों के साथ एक अद्भुत प्रेम जीवन प्रदान करती है। लेकिन जब यह युति नकारात्मक प्रभाव पैदा करती है, तो यह जातकों के रिश्तों को बहुत नुकसान पहुंचाती है और उनके प्रेम जीवन में दर्दनाक घटनाओं को जन्म देती है।",
    "mars8": "आठवें भाव में मंगल की स्थिति वाले जातक अत्यधिक भावुक और महत्वाकांक्षी हो सकते हैं। वे अपनी अधिकांश महत्वाकांक्षाएं प्राप्त करने में सक्षम हो सकते हैं। हालाँकि, उन्हें दूसरों पर कम हावी होने की जरूरत है और उन्हें अपने तरीके से चलने देना चाहिए। अगर वे ऐसा करने में सफल हो गए तो उन्हें बड़ी सफलता मिल सकती है।",
    "mars9": "नौवें घर में मंगल ग्रह के जातक   मिलनसार होंगे और यात्रा और अन्वेषण करना पसंद करेंगे। हालाँकि, उन्हें अपने दुस्साहस में बहुत सावधान रहना चाहिए। इसके अलावा, उन्हें अपनी मान्यताओं और आस्था को लेकर कम कठोर होने की जरूरत है।",
    "mars10": "दशम भाव में मंगल की स्थिति वाले जातकों में मंगल की अग्नि होगी। इसका उपयोग पेशे में उचित रूप से किया जा सकता है और परिणामस्वरूप जातक बहुत ऊंचे स्थान पर पहुंच सकते हैं। हालाँकि, इन जातकों को लोगों के साथ व्यवहार करते समय बहुत सावधान रहना होगा अन्यथा इनकी उतनी उन्नति नहीं हो पाएगी।",
    "mars11": "ग्यारहवें घर में मंगल आपको एक अच्छा टीम खिलाड़ी और एक अच्छा योजनाकार बनाता है जो लक्ष्यों को प्राप्त करने के लिए लक्ष्य निर्धारित कर सकता है;  लोग आपको एक प्रभावशाली व्यक्तित्व के रूप में देखते हैं।  ग्यारहवें घर में सकारात्मक मंगल आपको एक बड़ा सामाजिक नेटवर्क देता है।  इस स्थिति में मंगल गुरु मंगल योग बना सकता है जो आपको धनवान और समृद्ध बना सकता है।",
    "mars12": "जातकों की कुंडली के 12वें घर में मंगल आपको दुश्मनों और आपके परिवार और रिश्तेदारों के कई लोगों के बारे में चेतावनी दे सकता है जो आपके जीवनसाथी के साथ रिश्ते को खराब करने की कोशिश कर रहे होंगे। हालाँकि, पति-पत्नी तर्कशील भी हो सकते हैं और बंधन और विवाह की रक्षा के लिए छिपे हुए दुश्मनों को चुनौती दे सकते हैं । हालाँकि, 12वें घर में रहते हुए मंगल आपके विवाह में उच्च यौन अपेक्षाएँ ला सकता है, जिससे आप हर बार  उस पूर्ण यौन संतुष्टि का आनंद या अनुभव नहीं कर पाएंगे ।",

    "jupiter1": "आप बुद्धिमान और आध्यात्मिक होंगे। आप प्रबुद्ध हो जायेंगे. आपमें सकारात्मकता और उत्साह भी भरपूर है। यदि आप इस दिशा में प्रयास करते हैं तो आपका व्यक्तित्व बहुत समृद्ध हो सकता है। हालाँकि, आपको दूसरों के साथ व्यवहार करते समय सतर्क रहने की आवश्यकता है। यह अच्छी बात नहीं होगी यदि आप यह सोचकर किसी की मदद करते हैं कि उसे इसकी ज़रूरत है जबकि वास्तव में, वह इसे घुसपैठ या हस्तक्षेप के रूप में देख रहा है।",
    "jupiter2": "दूसरे घर में बृहस्पति निवासियों को बहुत समृद्धि और प्रचुरता देगा। और स्वदेशी लोग न केवल इन सुखों का आनंद लेंगे, बल्कि उन्हें पसंद भी करेंगे और उनकी सराहना भी करेंगे। बहरहाल, स्वदेशी को इन सुविधाओं पर निर्भर होकर विकास नहीं करना चाहिए। उन्हें सांसारिक सुखों में अत्यधिक लिप्त होने के साथ-साथ अस्वास्थ्यकर भोजन खाने से भी बचना चाहिए।",
    "jupiter3": "बृहस्पति आध्यात्मिक गुरु हैं। जब यह तीसरे भाव में रहता है तो जातक गतिशील, सशक्त, दूरदर्शी होते हैं। हालाँकि, उन्हें अधिक ध्यान केंद्रित करने की आवश्यकता होगी। केवल एक विशिष्ट लक्ष्य ही हमारी ऊर्जा को दिशा दे सकता है और हमें चमत्कार करने में सक्षम बना सकता है। और निश्चित रूप से तीसरे घर में बृहस्पति के जातक ऐसा कर सकते हैं।",
    "jupiter4": "जब बृहस्पति चौथे घर में आता है, तो यह उन्हें पर्याप्त धन, भाग्य, ज्ञान देता है और उनके पतन को सकारात्मक रूप से दूर करने में उनका समर्थन भी करता है। जातक अपनी ईमानदारी, देखभाल, वफादारी, आत्म-नियंत्रण और दृढ़ संकल्प के लिए जाने जाते हैं। व्यक्तियों के चौथे घर में बृहस्पति  उन्हें सभी आवश्यक सुख-सुविधाएं प्रदान करता है और उनकी शिक्षा को आकार देने में भी महत्वपूर्ण भूमिका निभाता है।",
    "jupiter5": "जिन जातकों के  पंचम भाव में बृहस्पति होता  है वे खुश, हंसमुख, चंचल और कुल मिलाकर स्वस्थ होते हैं। वे रिश्तों में अधिकतर अच्छे होते हैं। हालाँकि, उन्हें अपने अहंकार के प्रति सावधान रहना चाहिए। यदि उनका अहंकार बढ़ जाता है, तो इससे उन्हें गंभीर समस्याएँ और कठिनाइयाँ हो सकती हैं।",
    "jupiter6": "छठे भाव में बृहस्पति की स्थिति वाले जातक बहुत अच्छे कर्मचारी होते हैं। वे संपूर्ण पेशेवर हो सकते हैं. उनकी वास्तविकता संभावना बन सकती है यदि वे आलोचना के प्रति कम संवेदनशील हो जाएं और दूसरों की आलोचना को अधिक स्वस्थ और रचनात्मक तरीके से स्वीकार करें।",
    "jupiter7": "सातवें घर में बृहस्पति की उपस्थिति  जातकों को रिश्तों में उदार और उदार बनाती है। इन्हें जीवन में प्रचुर धन, बुद्धि, ज्ञान और सौभाग्य भी मिलता है। इस स्थान वाले जातक अत्यधिक जिम्मेदार, ईमानदार और दूसरों के प्रति उचित सम्मान रखने वाले होते हैं।  हालाँकि, 7वें घर में बृहस्पति का होना  दोधारी तलवार की तरह है, जो जातक पर नकारात्मक प्रभाव भी डाल सकता है।",
    "jupiter8": "आठवें भाव में बृहस्पति के जातक भव्य, नैतिक, कुशल और कुशल होते हैं। उनमें अपार संभावनाएं हैं. हालाँकि, यदि वे अधिक खुले और मिलनसार हैं, तो उनकी क्षमता वास्तविक होने की अधिक संभावना है।",
    "jupiter9": "नवम भाव में बृहस्पति की स्थिति वाले जातक बुद्धिमान और ज्ञानी होते हैं। वे अमीर और सफल भी हैं। वे अपने करियर को आगे बढ़ाने के लिए दूर-दराज के स्थानों पर जा सकते हैं। हालाँकि, उन्हें सावधान रहना चाहिए कि वे अपनी बढ़ती किस्मत में अपने दोस्तों और परिवार के सदस्यों को शामिल न करें।",
    "jupiter10": "बृहस्पति वैभव का प्रतीक है। दसवां घर पेशे और व्यवसाय का प्रतीक है। इसलिए, जब बृहस्पति दसवें घर में स्थित होता है, तो इसका मतलब पेशे और जीवन के अन्य क्षेत्रों में उच्च सफलता हो सकता है। हालाँकि, जातकों को दूसरों की कीमत पर खुद को अनावश्यक रूप से अधिक महत्व देने के प्रति सावधान रहना होगा।",
    "jupiter11": "बृहस्पति को उपचय यानि संचय का घर भी कहा जाता है। यह बुद्धि के साथ सौभाग्य लाता है। यह कानून, विवाह, अभिभावकों और मित्रों का प्रतिनिधित्व करता है। यह खेल कौशल, विज्ञान, ज्ञान और अधिकार को इंगित करता है। कुंडली में शुभ होने पर बृहस्पति अपने जातकों को समृद्ध धन का आशीर्वाद देता है। हालाँकि, कुंडली में अशुभ होने पर यह उन्हें अति आत्मविश्वासी और गैर-जिम्मेदार बना देता है। ग्यारहवें घर को मित्रों के घर के रूप में भी जाना जाता है क्योंकि यह मित्रों, समूहों और सभी प्रकार के संगठनों या क्लबों को दर्शाता है। यह दर्शाता है कि इसके मूल निवासी सामाजिक परिस्थितियों में कैसे बातचीत करेंगे और घुलमिल जाएंगे। यह उनके मानवीय पहलू, दान और सामाजिक उद्देश्य के लिए स्वयंसेवा को नियंत्रित करता है। यह उस सामाजिक क्षेत्र को भी दर्शाता है जिसमें उनकी स्वयंसेवा में रुचि हो सकती है। ग्यारहवें घर में बृहस्पति जातक के जीवन में अपार भाग्य ला सकता है। उनके पास बहुत सारा धन जमा हो सकता है और उनके मित्रों का एक बड़ा समूह भी हो सकता है।",
    "jupiter12": "मूल निवासी उसी जुनून और प्रयास का उपयोग करते हैं जो वे खुद को लाभ पहुंचाने के लिए दूसरों की मदद करने में करते हैं। वे उसी प्रकार की ख़ुशी के हक़दार हैं और इसे पाने के लिए उन्हें कोई त्याग नहीं करना पड़ता। बारहवें घर में बृहस्पति राष्ट्रीय एकता का प्रतिनिधित्व करता है। दूसरे शब्दों में, हर किसी को राष्ट्रीय मुद्दों पर सक्रिय होने का अधिकार है। यह व्यक्तियों को एक टीम के रूप में काम करने के तरीके के बारे में शिक्षित करने का एक शानदार तरीका भी हो सकता है।",

    "saturn1": "जातकों को अपनी क्षमताओं का सर्वोत्तम उपयोग करना चाहिए। वे अपनी गंभीरता को कुछ हद तक कम कर सकते हैं, जिससे उन्हें जीवन में अधिक प्रभावी बनने में मदद मिल सकती है। यदि वे उचित सलाह का पालन करें तो वे चमत्कार कर सकते हैं।",
    "saturn2": "दूसरे भाव में शनि की स्थिति से जातकों को  आर्थिक समस्याओं का सामना करना पड़ सकता है। हालाँकि, वे परिस्थितियों के प्रति अनुशासित और सख्त रहकर और परिदृश्य का बहादुरी से सामना करके अपनी बाधाओं और कमियों को दूर करने में सक्षम होंगे।",
    "saturn3": "कुल मिलाकर, तीसरे भाव में, यदि शनि ग्रह के प्रभाव से ऐसे जातक, कड़ी मेहनत करते हैं, और अपने भाग्य बदलने की ताकत रखते हैं। इस भाव में शनि की स्थिति जातक के वैवाहिक जीवन में सहयोग प्रदान करता है। यह जातक के जीवनसाथी के साथ एक मजबूत संबंध बनाने में भी सहायक होता है। ज्योतिष के अनुसार जातक का वैवाहिक जीवन तो सफल हो सकता है, लेकिन हो सकता है कि शनि का प्रभाव करियर और व्यवसाय को लेकर उतना अधिक अच्छा न हो जितना आप सोचते हों। इसके अलावा तीसरे भाव में शनि ग्रह जातक के बिल-चाल को भी प्रभावित करता हैं। इसके साथ ही जातक अपनी पढ़ाई भी पूरी नहीं कर पाते। परन्तु यदि, ज्योतिष के बताए गए उपायों को सही तरीके से करें तो शनि ग्रह के नकारात्मक प्रभावों से बचाव किया जा सकता है।",
    "saturn4": "शनि एक अशुभ ग्रह है और व्यक्तियों पर इसके बुरे प्रभाव के लिए व्यापक रूप से जाना जाता है। हालाँकि, व्यक्ति जीवन में शनि के सकारात्मक और नकारात्मक दोनों प्रभावों का अनुभव करते हैं। शनि का कार्मिक प्रभाव व्यक्ति के जीवन को धन, बुद्धि और विलासितापूर्ण सुख-सुविधाओं से युक्त बनाने में महत्वपूर्ण भूमिका निभाता है। जन्म कुंडली में शनि की उपस्थिति व्यक्तियों को अहंकारी, शांत और संदिग्ध बनाती है, लेकिन उनके घर की स्थिति के आधार पर, यह अनुकूल परिणाम भी प्रदान करता है, जो इन जातकों को शांतिपूर्ण, बुद्धिमान, तेज, समृद्ध और आध्यात्मिक बनाता है।",
    "saturn5": "पंचम भाव में शनि के जातक चमत्कार कर सकते हैं लेकिन उन्हें अपने आंतरिक प्रतिरोध और कठोरता पर काबू पाना होगा। उन्हें जीवन से गंभीरता को हटाकर अधिक आनंद की ओर बढ़ना होगा। यदि जीवन पूर्णतः आनंदमय नहीं है, तो यह पूर्णतया उबाऊ भी नहीं है।",
    "saturn6": "छठे भाव में शनि की स्थिति वाले जातक  सफल व्यक्ति हो सकते हैं। वे पेशेवर और व्यक्तिगत दोनों मोर्चों पर वास्तव में ऊंचा उठ सकते हैं। लेकिन उन्हें चीज़ों को लेकर ज़्यादा गंभीर होना बंद करना होगा। इन जातकों को यह समझना चाहिए कि हर चीज़ परफेक्ट नहीं हो सकती और जीवन भी आनंद के बारे में ह",
    "saturn7": "सातवें भाव में शनि वाले जातक सुखी जीवन का अनुभव करते हैं। यह उन्हें धन, शक्ति, पद और समाज में प्रतिष्ठा प्रदान करता है। हालाँकि, अपनी अशुभ प्रकृति के कारण, शनि व्यक्तियों के जीवन में प्रतिकूलताएँ ला सकता है, विशेषकर उनके विवाहित जीवन में। इसके अलावा, शनि का कर्म प्रभाव जातकों को तनावग्रस्त रखता है।",
    "saturn8": "आठवें घर में शनि के कारण जातकों के जीवन में मुख्य बाधाओं में से एक परिवर्तन के प्रति उनका दृष्टिकोण हो सकता है। यदि वे इसका समाधान करने में सक्षम हैं, तो वे चमत्कार कर सकते हैं।",
    "saturn9": "नौवें घर में शनि वाले लोग छोटी उम्र से ही समर्पित और मेहनती होते हैं।  वे अपने जीवन पर बहुत केंद्रित होते हैं और उनके जीवन का एक निश्चित रास्ता होता है जिसके द्वारा वे एक शानदार करियर बनाते हैं।  इन जातकों को अपने करियर में सफल वृद्धि मिलेगी।",
    "saturn10": "बृहस्पति वैभव का प्रतीक है। दसवां घर पेशे और व्यवसाय का प्रतीक है। इसलिए, जब बृहस्पति दसवें घर में स्थित होता है, तो इसका मतलब पेशे और जीवन के अन्य क्षेत्रों में उच्च सफलता हो सकता है। हालाँकि, जातकों को दूसरों की कीमत पर खुद को अनावश्यक रूप से अधिक महत्व देने के प्रति सावधान रहना होगा।",
    "saturn11": "एक बार जब आप कड़ी मेहनत और स्वयं प्रयास करते हैं, तो 11वें घर में शनि आपकी आशाओं और इच्छाओं को पूरा करता है।  इस घर में शनि किसी भी अन्य घर की तुलना में जल्दी परिणाम देता है।  यह स्थिति आपको जोड़-तोड़ कौशल प्रदान करती है और आप एक सफल राजनेता या व्यवसायी बन सकते हैं जो दुनिया भर में जीत हासिल कर सकता है।",
    "saturn12": "12वें घर में शनि: व्यक्ति को धर्मार्थ या पर्दे के पीछे के कार्यों के प्रति जिम्मेदारी की मजबूत भावना का अनुभव हो सकता है।  कारावास, अलगाव, या छिपे हुए शत्रुओं से संबंधित चुनौतियाँ उत्पन्न हो सकती हैं लेकिन व्यक्तिगत विकास के अवसर प्रदान करती हैं।",

    "rahu1": "वैदिक ज्योतिष में, राहु ग्रह को अक्सर ब्रह्मांड में नकारात्मक ऊर्जा और विघटनकारी शक्तियों से जोड़ा जाता है। जिन व्यक्तियों की कुंडली में राहु की स्थिति मजबूत है, उन्हें भ्रम, चिंता और अपने सच्चे मार्ग से अलग होने की भावना का अनुभव हो सकता है। यह ग्रह हमें हमारे लक्ष्यों और मूल्यों से भटका सकता है, और हमें नकारात्मक या विनाशकारी व्यवहार में शामिल होने के लिए मजबूर कर सकता है। हालाँकि, यह याद रखना महत्वपूर्ण है कि राहु का प्रभाव विकास और परिवर्तन के अवसर भी प्रदान कर सकता है। इसकी उपस्थिति को स्वीकार करके और इसके नकारात्मक प्रभावों को कम करने के लिए काम करके, व्यक्ति इस ग्रह की शक्ति का उपयोग करना सीख सकते हैं और इसका उपयोग खुद को अधिक सफलता और खुशी की ओर ले जाने के लिए कर सकते हैं। जबकि जागरूकता और सावधानीपूर्वक ध्यान देने से राहु एक चुनौतीपूर्ण शक्ति हो सकता है, इसके प्रभाव से निपटना और दूसरी तरफ मजबूत और अधिक पूर्ण होकर उभरना संभव है।",
    "rahu2": "दूसरे घर में, जो धन, परिवार और वाणी को नियंत्रित करता है, भ्रम के ग्रह राहु की स्थिति स्थानीय लोगों को वित्तीय समृद्धि की स्थिति में डाल सकती है। हालाँकि, राहु एक अशुभ ग्रह है, इसलिए इसका स्थानीय लोगों के जीवन पर नकारात्मक प्रभाव पड़ सकता है। इसलिए, दूसरे घर में राहु वाले लोगों के लिए यह महत्वपूर्ण है कि वे अपनी ताकत बनाएं और अपनी कमजोरियों से छुटकारा पाएं। इसके प्रतिकूल प्रभावों का प्रतिकार करने और यदि वांछित परिणाम नहीं मिल रहा है तो जीवन में आनंद बहाल करने के लिए राहु यंत्र का उपयोग करें।",
    "rahu3": "तीसरे घर में अशुभ राहु की स्थिति बहुत सहज या आसान नहीं है। जबकि तीसरे घर में कई अच्छे बिंदु हैं, वे राहु की गैर-सकारात्मक उपस्थिति से ग्रहण या अपवित्र हो रहे हैं। हालाँकि, अगर हम ज्योतिषीय तथ्यों को ध्यान में रखें और उसके अनुसार कार्य करें तो चीजों को बेहतर बनाया जा सकता है। ग्रहों की स्थिति संचित कर्मों के प्रभाव का प्रतीक है। लेकिन निश्चित रूप से, हमारे पास इसे बदलने का विकल्प और शक्ति है।",
    "rahu4": "चतुर्थ भाव में स्थित राहु किसी के जीवन को बनाने या नष्ट करने दोनों में महत्वपूर्ण भूमिका निभाता है। राहु के अधिकांश प्रभाव अशुभ होते हैं और वे प्रतिकूल विकास ला सकते हैं जिससे आध्यात्मिक मूल्यों का ह्रास हो सकता है। हालाँकि, राहु का नकारात्मक प्रभाव काफी हद तक कम हो सकता है।",
    "rahu5": "राहु भ्रम के बारे में है. यह धोखे के बारे में है. पंचम भाव में राहु के जातक प्रसिद्धि और गौरव की आकांक्षा रखते हैं लेकिन वे अपनी खोज में कुछ हद तक आगे बढ़ सकते हैं। वे धोखेबाज राहु के बहकावे में आ सकते हैं, इसलिए वे अपने लक्ष्यों को पूरा करने के लिए गलत तरीके अपना सकते हैं। जैसा कि हम जानते हैं कि अधर्म का अंततः पतन होना तय है, इसलिए इन जातकों को इस संबंध में बहुत सावधान रहने की आवश्यकता है। वास्तव में, साध्य और साधन दोनों ही नेक होने चाहिए।",
    "rahu6": "राहु एक अशुभ ग्रह है, जिसे काफी हद तक नकारात्मक माना जाता है। छठे भाव में इसकी स्थिति जातकों के लिए मिश्रित परिणाम पैदा करेगी। वे संघर्षों और कठिन परिस्थितियों का प्रबंधन करने और जरूरतमंदों को सहायता प्रदान करने में अच्छे हैं। हालाँकि, कुछ उत्तेजक स्थितियों में, वे विघटनकारी व्यवहार प्रदर्शित कर सकते हैं। उन्हें अच्छाई और खुशी में विश्वास खोने की संभावित संभावना का समाधान करना होगा।",
    "rahu7": "सातवें घर में राहु वाले व्यक्तियों को सुख और दुख का मिश्रित अनुभव मिलने की अधिक संभावना है। यदि वे अपने वैवाहिक जीवन का निर्माण करने में सक्षम हैं, तो वे आनंद और खुशी का आनंद ले सकते हैं। हालाँकि, यदि उनका वैवाहिक जीवन ख़राब हो जाता है, तो यह गंभीर कठिनाइयों का कारण बन सकता है।  व्यक्ति की कुंडली में राशि चक्र की प्रकृति के आधार पर राहु का लाभकारी प्रभाव हानिकारक में बदल सकता है। परिणामस्वरूप, व्यक्ति अपने ही विचारों में खोए रह सकते हैं, उनकी इच्छाएँ अधूरी रह सकती हैं और कभी-कभी उन्हें महसूस हो सकता है कि जीवन निरर्थक और उद्देश्यहीन है",
    "rahu8": "अष्टम भाव में राहु के जातक भले ही रहस्यमयी न हों लेकिन वे जटिल रहस्यों को सुलझा सकते हैं। जातकों में खुफिया एजेंसियों, जासूसों आदि जैसे व्यवसायों में ऊंचा उठने की क्षमता होती है। वे शोध कार्य में भी अच्छा प्रदर्शन कर सकते हैं। हालाँकि, उन्हें अनावश्यक विवादों और कानूनी मामलों से बचना चाहिए। वे अपनी ताकत पर भरोसा कर सकते हैं और अपनी कमजोरियों पर काम कर सकते हैं।",
    "rahu9": "नौवें घर में राहु की स्थिति वाले जातक ज्ञान में बहुत ऊंचे स्थान पर जा सकते हैं। हालाँकि, उन्हें परिवार में समस्याओं का सामना करना पड़ सकता है, विशेषकर अपने पिता के साथ। इसके अलावा इन्हें अपनी संतान से भी परेशानी का सामना करना पड़ सकता है। उन मामलों में उन्हें सावधान रहने की जरूरत होगी.",
    "rahu10": "दशम भाव में राहु की स्थिति वाले जातकों के पास अच्छे व्यावसायिक कौशल होते हैं। उनमें साहित्यिक रुचि भी हो सकती है। हालाँकि, इन्हें जीवन में सफलता बाद में ही मिलती है। महत्वाकांक्षी होना अच्छी बात है लेकिन जातकों को लक्ष्य हासिल करने के लिए गलत तरीकों का इस्तेमाल करने से बचना चाहिए।",
    "rahu11": "ग्यारहवां घर कमाई, लाभ, भाग्य, समृद्धि और प्रचुरता का प्रतिनिधित्व करता है। इससे यह भी पता चलता है कि जातक अपनी महत्वाकांक्षाओं या इच्छाओं को हासिल कर पाएगा या नहीं। राहु व्यक्ति को धोखेबाज, आलसी और सामाजिक बनाता है। इससे ग्यारहवें घर में राहु वाले जातक अपने आर्थिक लाभ के लिए अपने दोस्तों को धोखा देते हैं। हालाँकि, उन्हें अपनी मेहनत से अपने सपनों को हासिल करने का सुझाव दिया जाता है।",
    "rahu12": "बारहवें घर में राहु एक उत्साही स्वभाव और दान और स्वयंसेवक को देने की इच्छा का संकेत देता है। इसमें चिकित्सा और कानूनी मुद्दों से लाभ उठाने, विदेशी देशों की यात्रा करने और व्यवसाय शुरू करने, और तेजी से लाभ का अनुभव करने या भाग्य अर्जित करने के अवसर भी हैं। हालाँकि, दंड और दंड के कारण इसमें वित्तीय कठिनाई हो सकती है, और पिछले कार्यों, कर्मों और कठिनाइयों के कारण आपके लिए ऋण से बाहर निकलना मुश्किल हो सकता है। आपका स्वभाव लाभप्रद रहेगा, लेकिन दूसरे आपको हल्के में लेंग",

    "ketu1": "केतु राहु की तार्किक व्याख्या है। यह राहु द्वारा किए गए नुकसान को ठीक कर सकता है। यदि राहु आपको बुराई की ओर ले जाता है, तो केतु आपको यह एहसास दिलाने की क्षमता रखता है कि आप गलत जगह पर हैं। लेकिन ये बहुत आसानी से नहीं होता. केतु कुछ घटनाक्रमों को गति देगा, जो आपको बुरी तरह परेशान करेगा। हालाँकि, देर-सबेर आपको यह एहसास होने की संभावना है कि आपको बदलने की जरूरत है। अच्छे बनकर ही आप खुश रहेंगे।",
    "ketu2": "दूसरा भाव धन और वित्त के बारे में है। और केतु ग्रह बुराई से प्रस्थान और आध्यात्मिक और नैतिक की ओर बदलाव के बारे में है। इस प्रकार, जब केतु दूसरे घर में स्थित होता है, तो यह ज्ञान और बुद्धि का कारण बन सकता है। यह ज्ञान तब आ सकता है जब धन और वित्त के प्रति लगाव (जैसा कि दूसरे घर द्वारा दिखाया गया है) उस ज्ञान को जन्म दे सकता है जो मुक्ति और खुशी का मार्ग है।",
    "ketu3": "तीसरे भाव में केतु ग्रह वाले जातक शारीरिक रूप से स्वस्थ, हष्ट-पुष्ट, साहसी, उदार तो होते ही हैं साथ ही ऐसे जातक कुशाग्र बुद्धि और संपन्न भी होते हैं। इसके अलावा इन जातकों को कंधे तथा बाहों से संबंधित समस्या का सामना करना पड़ सकता है। इसके अतिरिक्त तीसरे भाव का केतु इन जातकों में मानसिक अशांति, तथा निराशाजनक विचारधारा की स्थिति भी उत्पन्न करता है।",
    "ketu4": "चतुर्थ भाव में केतु की उपस्थिति जातकों पर प्रतिकूल और सकारात्मक दोनों प्रभाव डालती है। केतु जातकों के जीवन को आकार देने में महत्वपूर्ण भूमिका निभाता है और यह आध्यात्मिकता का पक्षधर है। आपके शिक्षक, गुरु या गुरु की उपस्थिति आपकी सफलता में महत्वपूर्ण भूमिका निभाती है। वैदिक ज्योतिष के अनुसार, केतु का प्रभाव जातक के जीवन में लगभग सात वर्षों तक रहता है और यदि यह चंद्रमा के साथ हो तो अधिक प्रतिकूल परिणाम देता है। हालाँकि, चौथे घर में केतु के अशुभ प्रभाव को दूर किया जा सकता है यदि आप जानते हैं कि इससे कैसे निपटना है। ध्यान केंद्रित और स्पष्ट होना बहुत जरूरी है।",
    "ketu5": "इसलिए, पंचम भाव में केतु वाले जातक कई भाषाएं जान सकते हैं और संचार कौशल में अच्छे हो सकते हैं। हालाँकि, उन्हें बच्चा पैदा करने में असमर्थता और नकारात्मकता की भावना जैसी समस्याओं का सामना करना पड़ सकता है। लेकिन अगर वे साहस और दृढ़ता से काम लें तो वे इन समस्याओं पर काबू पा सकते हैं। पांचवें घर में राहु के लिए सही उपचार का उपयोग करके , वे वास्तव में अच्छा कर सकते हैं।",
    "ketu6": "छठे भाव में केतु की स्थिति जातकों को विभिन्न प्रकार की बीमारियों के प्रति संवेदनशील बनाएगी। किसी दुर्घटना का भी भय रहता है. हालाँकि, जातकों के पास दृढ़ इच्छाशक्ति और मानसिक ऊर्जा होगी, जिसका वे अपनी कठिनाइयों का समाधान करने के लिए भरपूर उपयोग कर सकते ह",
    "ketu7": "सातवें घर में केतु की स्थिति जातक पर सकारात्मक और नकारात्मक दोनों प्रभाव डालेगी। इससे उनके जीवन में ख़ुशी, प्यार, लगाव आ सकता है। हालाँकि, यह उनके व्यक्तिगत और व्यावसायिक जीवन दोनों में पतन का कारण बन सकता है। ऐसा हो सकता है कि इस स्थिति वाले जीवनसाथी के रिश्ते में दीर्घायु की कमी हो और वे बहुत पहले ही अलग हो जाएं। सातवें भाव में केतु के कारण जातक स्वभाव से क्रोधी हो सकते हैं। अगर उनकी आपस में नहीं बनती तो वे दूसरे व्यक्ति को गालियां भी दे सकते हैं। इस स्थिति वाले जातक दूसरों के प्रति द्वेष रख सकते हैं जो उन्हें नकारात्मक बना सकता है और उनके कष्टों को बढ़ा सकता है।",
    "ketu8": "आठवें भाव में केतु के जातकों को किसी भी दुर्घटना, बीमारी या दुर्घटना से सावधान रहना चाहिए क्योंकि जातक को इनमें से किसी का भी सामना करने की संभावना है। इसके अलावा, उनका आध्यात्मिक और आध्यात्मिक क्षेत्रों की ओर झुकाव हो सकता है। वे इसे विकसित कर सकते हैं और इसे अपनी सबसे मजबूत संपत्ति बना सकते हैं।",
    "ketu9": "नौवें घर में केतु के कारण जातकों का झुकाव परोपकारी और धर्मार्थ कार्यों की ओर हो सकता है। हालाँकि, कभी-कभी वे अनुभवहीन हो जाते हैं, जो उन्हें असुरक्षित बना सकता है। इसलिए, उन्हें वित्तीय और अन्य लेन-देन में बहुत सावधान रहना चाहिए अन्यथा उनका जीवन बहुत समस्याग्रस्त हो सकता है।",
    "ketu10": "दशम भाव में केतु होने पर जातक बुद्धिमान होते हैं। वे बहुत बुद्धिमान भी हो सकते हैं। हालाँकि, यदि दशम भाव में केतु अन्य ग्रहों के साथ प्रतिकूल संपर्क का सामना करता है , तो इससे गंभीर समस्याएं हो सकती हैं। जातकों को नैतिक मार्ग पर चलने की जरूरत है और समस्याओं और कठिनाइयों से अनुचित रूप से प्रभावित नहीं होना चाहिए। इस तरह वे एक सफल और खुशहाल जीवन जी सकते हैं।",
    "ketu11": "यदि हम कुंडली के ग्यारहवें भाव की बात करें तो यह भाव लाभ भाव होने के अलावा जातक का बाधा भाव भी माना जाता है। ग्यारहवां भाव मेष, कर्क, तुला और मकर राशियों के लिए बाधक साबित हो सकता है। कुंडली में ग्यारहवें भाव में अन्य ग्रहों की स्थिति और चाल से जातक के जीवन में आने वाली बाधाओं और कष्टों का अनुमान लगाया जा सकता है। यदि ग्यारहवें भाव में सकारात्मक ग्रह की स्थिति है, तो ऐसे जातक को कई अच्छे अवसर और कुछ समस्याएं मिल सकती हैं जिससे ये जातक आसानी से उभरने में सक्षम और सफल भी होंगे।",
    "ketu12": "12 वें घर में शनि:व्यक्ति को धर्मार्थ या पर्दे के पीछे के कार्यों के प्रति जिम्मेदारी की मजबूत भावना का अनुभव हो सकता है। कारावास, अलगाव, या छिपे हुए शत्रुओं से संबंधित चुनौतियाँ उत्पन्न हो सकती हैं लेकिन व्यक्तिगत विकास के अवसर प्रदान करती हैं।",

  }
  var a, c;


  a = document.getElementById("opt1").value;
  b = document.getElementById("opt2").value;


  if (a == "1" && b == "sun") {
    document.getElementById("text").innerHTML = data.sun1;
  }
  if (a == "2" && b == "sun") {
    document.getElementById("text").innerHTML = data.sun2;
  }
  if (a == "3" && b == "sun") {
    document.getElementById("text").innerHTML = data.sun3;
  }
  if (a == "4" && b == "sun") {
    document.getElementById("text").innerHTML = data.sun4;
  }
  if (a == "5" && b == "sun") {
    document.getElementById("text").innerHTML = data.sun5;
  }
  if (a == "6" && b == "sun") {
    document.getElementById("text").innerHTML = data.sun6;
  }
  if (a == "7" && b == "sun") {
    document.getElementById("text").innerHTML = data.sun7;
  }
  if (a == "8" && b == "sun") {
    document.getElementById("text").innerHTML = data.sun9;
  }
  if (a == "9" && b == "sun") {
    document.getElementById("text").innerHTML = data.sun9;
  }
  if (a == "10" && b == "sun") {
    document.getElementById("text").innerHTML = data.sun10;
  }
  if (a == "11" && b == "sun") {
    document.getElementById("text").innerHTML = data.sun11;
  }
  if (a == "12" && b == "sun") {
    document.getElementById("text").innerHTML = data.sun12;
  }

  else if (a == "1" && b == "moon") {
    document.getElementById("text").innerHTML = data.moon1;
  }
  else if (a == "2" && b == "moon") {
    document.getElementById("text").innerHTML = data.moon2;
  }
  else if (a == "3" && b == "moon") {
    document.getElementById("text").innerHTML = data.moon3;
  }
  else if (a == "4" && b == "moon") {
    document.getElementById("text").innerHTML = data.moon4;
  }
  else if (a == "5" && b == "moon") {
    document.getElementById("text").innerHTML = data.moon5;
  }
  else if (a == "6" && b == "moon") {
    document.getElementById("text").innerHTML = data.moon6;
  }
  else if (a == "7" && b == "moon") {
    document.getElementById("text").innerHTML = data.moon7;
  }
  else if (a == "8" && b == "moon") {
    document.getElementById("text").innerHTML = data.moon8;
  }
  else if (a == "9" && b == "moon") {
    document.getElementById("text").innerHTML = data.moon9;
  }
  else if (a == "10" && b == "moon") {
    document.getElementById("text").innerHTML = data.moon10;
  }
  else if (a == "11" && b == "moon") {
    document.getElementById("text").innerHTML = data.moon11;
  }
  else if (a == "12" && b == "moon") {
    document.getElementById("text").innerHTML = data.moon12;
  }

  else if (a == "1" && b == "mercury") {
    document.getElementById("text").innerHTML = data.mercury1;
  }
  else if (a == "2" && b == "mercury") {
    document.getElementById("text").innerHTML = data.mercury2;
  }
  else if (a == "3" && b == "mercury") {
    document.getElementById("text").innerHTML = data.mercury3;
  }
  else if (a == "4" && b == "mercury") {
    document.getElementById("text").innerHTML = data.mercury4;
  }
  else if (a == "5" && b == "mercury") {
    document.getElementById("text").innerHTML = data.mercury5;
  }
  else if (a == "6" && b == "mercury") {
    document.getElementById("text").innerHTML = data.mercury6;
  }
  else if (a == "7" && b == "mercury") {
    document.getElementById("text").innerHTML = data.mercury7;
  }
  else if (a == "8" && b == "mercury") {
    document.getElementById("text").innerHTML = data.mercury8;
  }
  else if (a == "9" && b == "mercury") {
    document.getElementById("text").innerHTML = data.mercury9;
  }
  else if (a == "10" && b == "mercury") {
    document.getElementById("text").innerHTML = data.mercury10;
  }
  else if (a == "11" && b == "mercury") {
    document.getElementById("text").innerHTML = data.mercury11;
  }
  else if (a == "12" && b == "mercury") {
    document.getElementById("text").innerHTML = data.mercury12;
  }

  else if (a == "1" && b == "venus") {
    document.getElementById("text").innerHTML = data.venus1;
  }
  else if (a == "2" && b == "venus") {
    document.getElementById("text").innerHTML = data.venus2;
  }
  else if (a == "3" && b == "venus") {
    document.getElementById("text").innerHTML = data.venus3;
  }
  else if (a == "4" && b == "venus") {
    document.getElementById("text").innerHTML = data.venus4;
  }
  else if (a == "5" && b == "venus") {
    document.getElementById("text").innerHTML = data.venus5;
  }
  else if (a == "6" && b == "venus") {
    document.getElementById("text").innerHTML = data.venus6;
  }
  else if (a == "7" && b == "venus") {
    document.getElementById("text").innerHTML = data.venus7;
  }
  else if (a == "8" && b == "venus") {
    document.getElementById("text").innerHTML = data.venus8;
  }
  else if (a == "9" && b == "venus") {
    document.getElementById("text").innerHTML = data.venus9;
  }
  else if (a == "10" && b == "venus") {
    document.getElementById("text").innerHTML = data.venus10;
  }
  else if (a == "11" && b == "venus") {
    document.getElementById("text").innerHTML = data.venus11;
  }
  else if (a == "12" && b == "venus") {
    document.getElementById("text").innerHTML = data.venus12;
  }

  else if (a == "1" && b == "mars") {
    document.getElementById("text").innerHTML = data.mars1;
  } else if (a == "2" && b == "mars") {
    document.getElementById("text").innerHTML = data.mars2;
  } else if (a == "3" && b == "mars") {
    document.getElementById("text").innerHTML = data.mars3;
  } else if (a == "4" && b == "mars") {
    document.getElementById("text").innerHTML = data.mars4;
  } else if (a == "5" && b == "mars") {
    document.getElementById("text").innerHTML = data.mars5;
  } else if (a == "6" && b == "mars") {
    document.getElementById("text").innerHTML = data.mars6;
  } else if (a == "7" && b == "mars") {
    document.getElementById("text").innerHTML = data.mars7;
  } else if (a == "8" && b == "mars") {
    document.getElementById("text").innerHTML = data.mars8;
  } else if (a == "9" && b == "mars") {
    document.getElementById("text").innerHTML = data.mars9;
  } else if (a == "10" && b == "mars") {
    document.getElementById("text").innerHTML = data.mars10;
  } else if (a == "11" && b == "mars") {
    document.getElementById("text").innerHTML = data.mars11;
  } else if (a == "12" && b == "mars") {
    document.getElementById("text").innerHTML = data.mars12;
  }

  else if (a == "1" && b == "jupiter") {
    document.getElementById("text").innerHTML = data.jupiter1;
  }
  else if (a == "2" && b == "jupiter") {
    document.getElementById("text").innerHTML = data.jupiter2;
  }
  else if (a == "3" && b == "jupiter") {
    document.getElementById("text").innerHTML = data.jupiter3;
  }
  else if (a == "4" && b == "jupiter") {
    document.getElementById("text").innerHTML = data.jupiter4;
  }
  else if (a == "5" && b == "jupiter") {
    document.getElementById("text").innerHTML = data.jupiter5;
  }
  else if (a == "6" && b == "jupiter") {
    document.getElementById("text").innerHTML = data.jupiter6;
  }
  else if (a == "7" && b == "jupiter") {
    document.getElementById("text").innerHTML = data.jupiter7;
  }
  else if (a == "8" && b == "jupiter") {
    document.getElementById("text").innerHTML = data.jupiter8;
  }
  else if (a == "9" && b == "jupiter") {
    document.getElementById("text").innerHTML = data.jupiter9;
  }
  else if (a == "10" && b == "jupiter") {
    document.getElementById("text").innerHTML = data.jupiter10;
  }
  else if (a == "11" && b == "jupiter") {
    document.getElementById("text").innerHTML = data.jupiter11;
  }
  else if (a == "12" && b == "jupiter") {
    document.getElementById("text").innerHTML = data.jupiter12;
  }

  else if (a == "1" && b == "saturn") {
    document.getElementById("text").innerHTML = data.saturn1;
  } else if (a == "2" && b == "saturn") {
    document.getElementById("text").innerHTML = data.saturn2;
  } else if (a == "3" && b == "saturn") {
    document.getElementById("text").innerHTML = data.saturn3;
  } else if (a == "4" && b == "saturn") {
    document.getElementById("text").innerHTML = data.saturn4;
  } else if (a == "5" && b == "saturn") {
    document.getElementById("text").innerHTML = data.saturn5;
  } else if (a == "6" && b == "saturn") {
    document.getElementById("text").innerHTML = data.saturn6;
  } else if (a == "7" && b == "saturn") {
    document.getElementById("text").innerHTML = data.saturn7;
  } else if (a == "8" && b == "saturn") {
    document.getElementById("text").innerHTML = data.saturn8;
  } else if (a == "9" && b == "saturn") {
    document.getElementById("text").innerHTML = data.saturn9;
  } else if (a == "10" && b == "saturn") {
    document.getElementById("text").innerHTML = data.saturn10;
  } else if (a == "11" && b == "saturn") {
    document.getElementById("text").innerHTML = data.saturn10;
  } else if (a == "12" && b == "saturn") {
    document.getElementById("text").innerHTML = data.saturn12;
  }

  else if (a == "1" && b == "rahu") {
    document.getElementById("text").innerHTML = data.rahu1;
  }
  else if (a == "2" && b == "rahu") {
    document.getElementById("text").innerHTML = data.rahu2;
  }
  else if (a == "3" && b == "rahu") {
    document.getElementById("text").innerHTML = data.rahu3;
  }
  else if (a == "4" && b == "rahu") {
    document.getElementById("text").innerHTML = data.rahu4;
  }
  else if (a == "5" && b == "rahu") {
    document.getElementById("text").innerHTML = data.rahu5;
  }
  else if (a == "6" && b == "rahu") {
    document.getElementById("text").innerHTML = data.rahu6;
  }
  else if (a == "7" && b == "rahu") {
    document.getElementById("text").innerHTML = data.rahu7;
  }
  else if (a == "8" && b == "rahu") {
    document.getElementById("text").innerHTML = data.rahu8;
  }
  else if (a == "9" && b == "rahu") {
    document.getElementById("text").innerHTML = data.rahu9;
  }
  else if (a == "10" && b == "rahu") {
    document.getElementById("text").innerHTML = data.rahu10;
  }
  else if (a == "11" && b == "rahu") {
    document.getElementById("text").innerHTML = data.rahu11;
  }
  else if (a == "12" && b == "rahu") {
    document.getElementById("text").innerHTML = data.rahu12;
  }

  else if (a == "1" && b == "ketu") {
    document.getElementById("text").innerHTML = data.ketu1;
  }
  else if (a == "2" && b == "ketu") {
    document.getElementById("text").innerHTML = data.ketu2;
  }
  else if (a == "3" && b == "ketu") {
    document.getElementById("text").innerHTML = data.ketu3;
  }
  else if (a == "4" && b == "ketu") {
    document.getElementById("text").innerHTML = data.ketu4;
  }
  else if (a == "5" && b == "ketu") {
    document.getElementById("text").innerHTML = data.ketu5;
  }
  else if (a == "6" && b == "ketu") {
    document.getElementById("text").innerHTML = data.ketu6;
  }
  else if (a == "7" && b == "ketu") {
    document.getElementById("text").innerHTML = data.ketu7;
  }
  else if (a == "8" && b == "ketu") {
    document.getElementById("text").innerHTML = data.ketu8;
  }
  else if (a == "9" && b == "ketu") {
    document.getElementById("text").innerHTML = data.ketu9;
  }
  else if (a == "10" && b == "ketu") {
    document.getElementById("text").innerHTML = data.ketu10;
  }
  else if (a == "11" && b == "ketu") {
    document.getElementById("text").innerHTML = data.ketu11;
  }
  else if (a == "12" && b == "ketu") {
    document.getElementById("text").innerHTML = data.ketu12;
  }
}
